Core/src/Documents/ТаможенноеОформление/ТаможенноеОформление.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ТаможенноеОформление</name>
  <basedOn>Document.ПриходнаяНакладная</basedOn>
  <registerRecords>AccumulationRegister.СебестоимостьЗакупки</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыПоНалогам</registerRecords>
  <registerRecords>AccumulationRegister.Запасы</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерИмпортаA</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерИмпортаC</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидНалогаНДС</name>
    <type>
      <types>CatalogRef.ВидыНалогов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидИмпорта</name>
    <type>
      <types>CatalogRef.ВидыНалогов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ПриходнаяНакладная</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Запасы</name>
    <attributes>
      <name>ТоварнаяНоменклатураВЭД</name>
      <type>
        <types>CatalogRef.КлассификаторТНВЭД</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументПоступления</name>
      <type>
        <types>DocumentRef.ПриходнаяНакладная</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаРасходовНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>UnitNetWeight</name>
      <comment>Unit net weight</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>UnitGrossWeight</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>AmountNet</name>
      <comment>Amount net</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>AmountGross</name>
      <comment>Amount gross</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>PerNetWeight</name>
      <comment>Per net weight</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>PerGrossWeight</name>
      <comment>Per Gross Weight</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>PerPiece</name>
      <comment>Per Piece</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>PercentOnPrice</name>
      <comment>% on price</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>CostOfTheProductOur</name>
      <comment>Cost of The Product Our</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>CostOfTheProductRSge</name>
      <comment>Cost of The Product RS.ge</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>CalculatedByProgram</name>
    <attributes>
      <name>ТоварнаяНоменклатураВЭД</name>
      <type>
        <types>CatalogRef.КлассификаторТНВЭД</types>
      </type>
    </attributes>
    <attributes>
      <name>PerNetWeight</name>
      <comment>Per net weight</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>PerGrossWeight</name>
      <comment>Per Gross Weight</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>PerPiece</name>
      <comment>Per Piece</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>PercentOnPrice</name>
      <comment>% on price</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>CalculatedByCustoms</name>
    <attributes>
      <name>ТоварнаяНоменклатураВЭД</name>
      <type>
        <types>CatalogRef.КлассификаторТНВЭД</types>
      </type>
    </attributes>
    <attributes>
      <name>PerNetWeight</name>
      <comment>Per net weight</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>PerGrossWeight</name>
      <comment>Per Gross Weight</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>PerPiece</name>
      <comment>Per Piece</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>PercentOnPrice</name>
      <comment>% on price</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Core/src/Enums/ВидыОперацийПриходнаяНакладная/ВидыОперацийПриходнаяНакладная.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийПриходнаяНакладная</name>
  <enumValues>
    <name>ПоступлениеОтПоставщика</name>
  </enumValues>
  <enumValues>
    <name>ПриемНаКомиссию</name>
  </enumValues>
  <enumValues>
    <name>ПриемВПереработку</name>
  </enumValues>
  <enumValues>
    <name>ПриемНаОтветхранение</name>
  </enumValues>
  <enumValues>
    <name>ВозвратОтПокупателя</name>
  </enumValues>
  <enumValues>
    <name>ВозвратОтКомиссионера</name>
  </enumValues>
  <enumValues>
    <name>ВозвратОтПереработчика</name>
  </enumValues>
  <enumValues>
    <name>ВозвратСОтветхранения</name>
  </enumValues>
  <enumValues>
    <name>ЗакупкаКапитальныхЗатрат</name>
  </enumValues>
</mdclass:Enum>

Core/src/Documents/ТаможенноеОформление/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиБиблиотек

// СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
&НаКлиенте
Процедура Подключаемый_ВыполнитьНазначаемуюКоманду(Команда)
	
	Если НЕ ДополнительныеОтчетыИОбработкиКлиент.ВыполнитьНазначаемуюКомандуНаКлиенте(ЭтотОбъект, Команда.Имя) Тогда
		РезультатВыполнения = Неопределено;
		ДополнительныеОтчетыИОбработкиВыполнитьНазначаемуюКомандуНаСервере(Команда.Имя, РезультатВыполнения);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДополнительныеОтчетыИОбработкиВыполнитьНазначаемуюКомандуНаСервере(ИмяЭлемента, РезультатВыполнения)
	
	ДополнительныеОтчетыИОбработки.ВыполнитьНазначаемуюКомандуНаСервере(ЭтотОбъект, ИмяЭлемента, РезультатВыполнения);
	
КонецПроцедуры
// Конец СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки

// СтандартныеПодсистемы.Печать
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуПечати(Команда)
	
	УправлениеПечатьюКлиент.ВыполнитьПодключаемуюКомандуПечати(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец СтандартныеПодсистемы.Печать

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
	
	// СтандартныеПодсистемы.Печать
	УправлениеПечатью.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюПечать);
	// Конец СтандартныеПодсистемы.Печать
	УправлениеНебольшойФирмойСервер.УстановитьОтображаниеПодменюПечати(Элементы.ПодменюПечать);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
		
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.ОценкаПроизводительности
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		ОценкаПроизводительностиКлиент.НачатьЗамерВремени(Истина, "Проведение"+ РаботаСФормойДокументаКлиентСервер.ПолучитьИмяФормыСтрокой(ЭтотОбъект.ИмяФормы));
	КонецЕсли;
	// СтандартныеПодсистемы.ОценкаПроизводительности
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
		
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(Элемент.ТекстРедактирования, ЭтотОбъект, "Объект.Комментарий");
	
КонецПроцедуры

&НаСервере
Процедура ПодборНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура Подбор(Команда)
	
	ДатаФильтра = ?(ЗначениеЗаполнено(Объект.Дата),Объект.Дата,ТекущаяДата());
	ПараметрыОтрытия = Новый Структура;
	СтруктураОтбора  = Новый Структура("Организация, Дата", Объект.Организация, ДатаФильтра);
	
	ПараметрыОтрытия.Вставить("Отборы", СтруктураОтбора);
	
	
	АдресТаблицыВХранилище = ПоместитьТаблицуВХранилище();
	ПараметрыОтрытия.Вставить("АдресТаблицыВХранилище", АдресТаблицыВХранилище);
	
	ОткрытьФорму("Документ.ТаможенноеОформление.Форма.ФормаПодбора", ПараметрыОтрытия, ЭтаФорма,,,, Новый ОписаниеОповещения("ПодборЗаполнениеТабЧастиТовары", ЭтотОбъект, Новый Структура("АдресТаблицыВХранилище", АдресТаблицыВХранилище)));
	
КонецПроцедуры

Функция ПоместитьТаблицуВХранилище()
	
	Возврат ПоместитьВоВременноеХранилище(
		Объект.Запасы.Выгрузить(,
			"ДокументПоступления,
			|Номенклатура,
			|Характеристика,
			|Количество,
			|ЕдиницаИзмерения,
			|Цена,
			|Сумма,
			|СтавкаНДС
			|"),
		УникальныйИдентификатор
	);
	
КонецФункции

&НаКлиенте
Процедура ПодборЗаполнениеТабЧастиТовары(Результат, ДополнительныеПараметры) Экспорт

	АдресТаблицыВХранилище = ДополнительныеПараметры.АдресТаблицыВХранилище;
    
    КодВозврата = Результат;
    
    РедактироватьЗачетПредоплатыФрагмент(АдресТаблицыВХранилище, КодВозврата);

КонецПроцедуры

&НаКлиенте
Процедура РедактироватьЗачетПредоплатыФрагмент(Знач АдресТаблицыВХранилище, Знач КодВозврата)
    
    Если (КодВозврата = КодВозвратаДиалога.OK) Тогда
        ПолучитьПредоплатаИзХранилища(АдресТаблицыВХранилище);
    КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПолучитьПредоплатаИзХранилища(АдресТаблицыВХранилище)
	
	ТаблицаДляЗагрузки = ПолучитьИзВременногоХранилища(АдресТаблицыВХранилище);
	Объект.Запасы.Загрузить(ТаблицаДляЗагрузки);
	
	Документ = РеквизитФормыВЗначение("Объект");
	Документ.РассчитатьТаблицы(ИСТИНА);
	ЗначениеВРеквизитФормы(Документ, "Объект");
	
КонецПроцедуры

&НаСервере
Процедура ЗапасыНоменклатураПриИзмененииНаСервере(УИД)
	
	ТекСтрок = Объект.Запасы.НайтиПоИдентификатору(УИД);
	Если НЕ ЗначениеЗаполнено(ТекСтрок.ДокументПоступления) Тогда 
		Сообщить(НСтр("ka='Укажите документ!';ru='Укажите документ!';en='Specify the document!'"));
		ТекСтрок.Номенклатура = Справочники.Номенклатура.ПустаяСсылка();
		ТекСтрок.ЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.ПустаяСсылка();
		ТекСтрок.Характеристика = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
		ТекСтрок.Количество = 0;
		ТекСтрок.Цена = 0;
		ТекСтрок.Сумма = 0;
		ТекСтрок.СтавкаНДС = Справочники.СтавкиНДС.ПустаяСсылка();
		Возврат;
	КонецЕсли;
	
	тчЗапасыДокумента = ТекСтрок.ДокументПоступления.Запасы;
	
	МассивСтрокЗапасов = тчЗапасыДокумента.НайтиСтроки(Новый Структура("Номенклатура", ТекСтрок.Номенклатура));
	
	Если МассивСтрокЗапасов.Количество() = 0 Тогда 
		Сообщить(НСтр("ka='В документе нет указанной номенклатуры!';ru='В документе нет указанной номенклатуры!';en='The document is not specified range!'"));
		ТекСтрок.Номенклатура = Справочники.Номенклатура.ПустаяСсылка();
		Возврат;
	КонецЕсли;
	
	ТекСтрок.СтавкаНДС = ТекСтрок.Номенклатура.СтавкаНДС;
	ТекСтрок.ЕдиницаИзмерения = ТекСтрок.Номенклатура.ЕдиницаИзмерения;
		
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыНоменклатураПриИзменении(Элемент)
	
	ОчиститьСообщения();
	ТекСтрокаЗапасы = Элементы.Запасы.ТекущиеДанные;
	УИД = ТекСтрокаЗапасы.ПолучитьИдентификатор();
	
	ЗапасыНоменклатураПриИзмененииНаСервере(УИД);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыНоменклатураНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекСтрокаЗапасы = Элементы.Запасы.ТекущиеДанные;
	
	МассивНоменклатур = Новый Массив;
	
	Если ЗначениеЗаполнено(ТекСтрокаЗапасы.ДокументПоступления) Тогда 
		МассивНоменклатур = ПолучитьМассивНоменклатурыНаСервере(ТекСтрокаЗапасы.ПолучитьИдентификатор());
	КонецЕсли;
	
	
	НовыйПараметр = Новый ПараметрВыбора("Отбор.Ссылка", МассивНоменклатур);
    НовыйМассив = Новый Массив();
    НовыйМассив.Добавить(НовыйПараметр);
    НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
    Элементы.ЗапасыНоменклатура.ПараметрыВыбора = НовыеПараметры;
	
КонецПроцедуры

&НаСервере
Функция  ПолучитьМассивНоменклатурыНаСервере(УИДСтроки)

	ТекСтрока = Объект.Запасы.НайтиПоИдентификатору(УИДСтроки);
	тчЗапасыПрихода = ТекСтрока.ДокументПоступления.Запасы;
	
	МассивВозврата = тчЗапасыПрихода.ВыгрузитьКолонку("Номенклатура");

	Возврат МассивВозврата;
	
КонецФункции

&НаКлиенте
Процедура ЗапасыДокументПоступленияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	НовыйПараметрПроведен = Новый ПараметрВыбора("Отбор.Проведен", Истина);
	НовыйПараметрОрганизация = Новый ПараметрВыбора("Отбор.Организация", Объект.Организация);
	НовыйПараметрВидОперации = Новый ПараметрВыбора("Отбор.ВидОперации", ПредопределенноеЗначение("Перечисление.ВидыОперацийПриходнаяНакладная.ПоступлениеОтПоставщика"));
	
    НовыйМассив = Новый Массив();
    НовыйМассив.Добавить(НовыйПараметрПроведен);
	НовыйМассив.Добавить(НовыйПараметрОрганизация);
	НовыйМассив.Добавить(НовыйПараметрВидОперации);
    НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
    Элементы.ЗапасыНоменклатура.ПараметрыВыбора = НовыеПараметры;
	
КонецПроцедуры

&НаСервере
Процедура РаспределитьПоСуммеНДСНаСервере()
	
	Документ = РеквизитФормыВЗначение("Объект");
	Документ.РаспределитьСуммуНДСПоСуммеНДС();
	ЗначениеВРеквизитФормы(Документ, "Объект");
	
КонецПроцедуры

&НаКлиенте
Процедура РаспределитьПоСуммеНДС(Команда)
	
	Если Объект.СуммаНДС = 0 Тогда 
		УправлениеНебольшойФирмойКлиент.СообщитьОбОшибке(Объект, НСтр("ka='დღგ–ს გადანაწილებამდე მიუთითეთ დღგ–ს თანხა!';ru='Укажите сумму НДС!';en='Specify the amount of VAT!'"));
		Возврат;
	КонецЕсли;
	
	РаспределитьПоСуммеНДСНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыКоличествоПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Запасы.ТекущиеДанные;
	
	СтрокаТабличнойЧасти.Сумма = СтрокаТабличнойЧасти.Количество * СтрокаТабличнойЧасти.Цена;
	
	РассчитатьСуммуНДС(СтрокаТабличнойЧасти);
	//ОбновитьПодвалФормы();
	//РассчитатьОбъемИВесВДокументе();
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыЦенаПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Запасы.ТекущиеДанные;
	
	СтрокаТабличнойЧасти.Сумма = СтрокаТабличнойЧасти.Количество * СтрокаТабличнойЧасти.Цена;
	
	РассчитатьСуммуНДС(СтрокаТабличнойЧасти);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыСуммаПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Запасы.ТекущиеДанные;
	
	// Цена.
	Если СтрокаТабличнойЧасти.Количество <> 0 Тогда
		СтрокаТабличнойЧасти.Цена = СтрокаТабличнойЧасти.Сумма / СтрокаТабличнойЧасти.Количество;
	КонецЕсли;
	
	РассчитатьСуммуНДС(СтрокаТабличнойЧасти);
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСуммуНДС(СтрокаТабличнойЧасти)
	
	СтавкаНДС = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеСтавкиНДС(СтрокаТабличнойЧасти.СтавкаНДС);
	
	СтрокаТабличнойЧасти.СуммаРасходовНДС = СтрокаТабличнойЧасти.Сумма * СтавкаНДС / 100;
	
КонецПроцедуры // РассчитатьСуммуНДС()

&НаКлиенте
Процедура ЗапасыСтавкаНДСПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Запасы.ТекущиеДанные;
	
	РассчитатьСуммуНДС(СтрокаТабличнойЧасти);
	
КонецПроцедуры

&НаКлиенте
Процедура CalculatedByCustomsПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	СтрокаТабличнойЧасти = Элементы.CalculatedByCustoms.ТекущиеДанные;
	CalculatedByCustomsПриОкончанииРедактированияНаСервере(СтрокаТабличнойЧасти.ПолучитьИдентификатор());
	
КонецПроцедуры

&НаСервере
Процедура CalculatedByCustomsПриОкончанииРедактированияНаСервере(ИдентификаторСтроки)
	
	СтрокаТабличнойЧасти = Объект.CalculatedByCustoms.НайтиПоИдентификатору(ИдентификаторСтроки);
	Если НЕ СтрокаТабличнойЧасти = НЕОПРЕДЕЛЕНО Тогда
	
		Если ЗначениеЗаполнено(СтрокаТабличнойЧасти.ТоварнаяНоменклатураВЭД) Тогда
			
			Документ = РеквизитФормыВЗначение("Объект");
		
			МассивНайденныхСтрок = Объект.Запасы.НайтиСтроки(Новый Структура("ТоварнаяНоменклатураВЭД", СтрокаТабличнойЧасти.ТоварнаяНоменклатураВЭД));
			Для каждого СтрМассивНайденныхСтрок Из МассивНайденныхСтрок Цикл
				Документ.РассчитатьПоСтрокеCostOfTheProduct(СтрМассивНайденныхСтрок.НомерСтроки);
			КонецЦикла;
			
			ЗначениеВРеквизитФормы(Документ, "Объект");
		
		КонецЕсли;
	
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьТаблицы(Команда)
	
	ПересчитатьТаблицыНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПересчитатьТаблицыНаСервере()
	
	Документ = РеквизитФормыВЗначение("Объект");
	Документ.РассчитатьТаблицы(ЛОЖЬ);
	ЗначениеВРеквизитФормы(Документ, "Объект");
	
КонецПроцедуры
